import pytest
from pyplgr_core.api import to_token_list

@pytest.mark.parametrize(
    [
        "text",
        "expected"
    ],
    [
        pytest.param("", []),
        pytest.param("α", ["α"]),
        pytest.param("δ'", ["δ'"]),
        pytest.param("ὁ ἄνθρωπός τις", ["ὁ", "ἄνθρωπός", "τις"]),
        pytest.param(
            """Πάντες ἄνθρωποι τοῦ εἰδέναι ὀρέγονται φύσει. σημεῖον δ'
ἡ τῶν αἰσθήσεων ἀγάπησις· καὶ γὰρ χωρὶς τῆς χρείας
ἀγαπῶνται δι' αὑτάς, καὶ μάλιστα τῶν ἄλλων ἡ διὰ τῶν
ὀμμάτων. οὐ γὰρ μόνον ἵνα πράττωμεν ἀλλὰ καὶ μηθὲν
μέλλοντες πράττειν τὸ ὁρᾶν αἱρούμεθα ἀντὶ πάντων ὡς εἰπεῖν
τῶν ἄλλων.""",
            [
                "Πάντες", "ἄνθρωποι", "τοῦ", "εἰδέναι", "ὀρέγονται", "φύσει", ".", "σημεῖον", "δ'",
                "ἡ", "τῶν", "αἰσθήσεων", "ἀγάπησις", "·", "καὶ", "γὰρ", "χωρὶς", "τῆς", "χρείας", 
                "ἀγαπῶνται", "δι'", "αὑτάς", ",", "καὶ", "μάλιστα", "τῶν", "ἄλλων", "ἡ", "διὰ", "τῶν", 
                "ὀμμάτων", ".", "οὐ", "γὰρ", "μόνον", "ἵνα", "πράττωμεν", "ἀλλὰ", "καὶ", "μηθὲν",
                "μέλλοντες", "πράττειν", "τὸ", "ὁρᾶν", "αἱρούμεθα", "ἀντὶ", "πάντων", "ὡς", "εἰπεῖν",
                "τῶν", "ἄλλων", ".",
            ]
        ),
        pytest.param(
            """τὸ δ' ὅτι πᾶσι τοῖς τοιοῖσδε κατ' εἶδος ἓν ἀφορισθεῖσι,
κάμνουσι τηνδὶ τὴν νόσον, συνήνεγκεν, [ οἷον τοῖς φλεγματώδεσιν
ἢ χολώδεσι [ἢ] πυρέττουσι καύσῳ], τέχνης.-πρὸς μὲν
οὖν τὸ πράττειν ἐμπειρία τέχνης οὐδὲς δοκεῖ διαφέρειν,""",
            [
                "τὸ", "δ'", "ὅτι", "πᾶσι", "τοῖς", "τοιοῖσδε", "κατ'", "εἶδος", "ἓν", "ἀφορισθεῖσι", ",",
                "κάμνουσι", "τηνδὶ", "τὴν", "νόσον", ",", "συνήνεγκεν", ",", "[", "οἷον", "τοῖς", "φλεγματώδεσιν",
                "ἢ", "χολώδεσι", "[", "ἢ", "]", "πυρέττουσι", "καύσῳ", "]", ",", "τέχνης", ".", "-", "πρὸς", "μὲν",
                "οὖν", "τὸ", "πράττειν", "ἐμπειρία", "τέχνης", "οὐδὲς", "δοκεῖ", "διαφέρειν", ",",
            ]
        ),
    ]
)
def test_to_token_list(text, expected):
    actual = to_token_list(text)
    assert expected == actual
